In [1]:
import pandas as pd

In [2]:
with open('Social_Network_Ads.csv') as inp_f:
    pd_data = pd.read_csv(inp_f)

In [4]:
print(pd_data.head(2)) ##shows n rows of the table

    User ID Gender  Age  EstimatedSalary  Purchased
0  15624510   Male   19            19000          0
1  15810944   Male   35            20000          0

In [5]:
print(pd_data.tail(2)) ##shows n rows of the table

      User ID  Gender  Age  EstimatedSalary  Purchased
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
pd_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [7]:
pd_data.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [10]:
pd_counts = pd_data.apply(pd.Series.value_counts)

In [11]:
print(pd_counts)

          User ID  Gender  Age  EstimatedSalary  Purchased
0             NaN     NaN  NaN              NaN      257.0
1             NaN     NaN  NaN              NaN      143.0
18            NaN     NaN  5.0              NaN        NaN
19            NaN     NaN  7.0              NaN        NaN
20            NaN     NaN  7.0              NaN        NaN
...           ...     ...  ...              ...        ...
15814553      1.0     NaN  NaN              NaN        NaN
15814816      1.0     NaN  NaN              NaN        NaN
15815236      1.0     NaN  NaN              NaN        NaN
Female        NaN   204.0  NaN              NaN        NaN
Male          NaN   196.0  NaN              NaN        NaN

[564 rows x 5 columns]

In [12]:
pd.isnull(pd_counts##will show all values that are null or not null

          User ID  Gender    Age  EstimatedSalary  Purchased
0            True    True   True             True      False
1            True    True   True             True      False
18           True    True  False             True       True
19           True    True  False             True       True
20           True    True  False             True       True
...           ...     ...    ...              ...        ...
15814553    False    True   True             True       True
15814816    False    True   True             True       True
15815236    False    True   True             True       True
Female       True   False   True             True       True
Male         True   False   True             True       True

[564 rows x 5 columns]

In [14]:
age = pd_counts['Age']
print(age)

0           NaN
1           NaN
18          5.0
19          7.0
20          7.0
           ...
15814553    NaN
15814816    NaN
15815236    NaN
Female      NaN
Male        NaN
Name: Age, Length: 564, dtype: float64

In [16]:
age=age.dropna()
print(age)

18     5.0
19     7.0
20     7.0
21     4.0
22     5.0
23     6.0
24     9.0
25     6.0
26    16.0
27    13.0
28    12.0
29    10.0
30    11.0
31    11.0
32     9.0
33     9.0
34     6.0
35    32.0
36    12.0
37    20.0
38    13.0
39    15.0
40    15.0
41    16.0
42    16.0
43     3.0
44     2.0
45     7.0
46    12.0
47    14.0
48    14.0
49    10.0
50     4.0
51     3.0
52     6.0
53     5.0
54     4.0
55     3.0
56     3.0
57     5.0
58     6.0
59     7.0
60     7.0
Name: Age, dtype: float64

In [19]:
last2rows = pd_counts.iloc[-2:,:]
print(last2rows)

        User ID  Gender  Age  EstimatedSalary  Purchased
Female      NaN   204.0  NaN              NaN        NaN
Male        NaN   196.0  NaN              NaN        NaN

In [21]:
cleaned_last2rows = last2rows.dropna(axis=1)
print(cleaned_last2rows)

        Gender
Female   204.0
Male     196.0

In [23]:
salaries = pd_counts['EstimatedSalary']

In [24]:
print(salaries)

0          NaN
1          NaN
18         NaN
19         NaN
20         NaN
            ..
15814553   NaN
15814816   NaN
15815236   NaN
Female     NaN
Male       NaN
Name: EstimatedSalary, Length: 564, dtype: float64

In [27]:
salaries = salaries.fillna(0).astype(int)
print(salaries)

0           0
1           0
18          0
19          0
20          0
           ..
15814553    0
15814816    0
15815236    0
Female      0
Male        0
Name: EstimatedSalary, Length: 564, dtype: int32